app/models/period.rb

SELECT 1 AS one FROM "periods" WHERE "periods"."hospital_id" = '67ea0003-b267-43de-bf2d-7a017e4f7d42' AND "periods"."id" IS NOT NULL AND (start_date <= '2024-12-31' AND end_date >= '2024-07-01') LIMIT 1
---
  def date_range_not_overlap
    return unless start_date && end_date

    overlapping = hospital.periods.where.not(id: id)
                         .where('start_date <= ? AND end_date >= ?', end_date, start_date)

    if overlapping.exists?